Catalogs/ТипыРабочихДней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТипыРабочихДней</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВОтчетах</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходнойПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТипыРабочихДней/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если РабочийПоУмолчанию Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТипыРабочихДней.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ТипыРабочихДней КАК ТипыРабочихДней
			|ГДЕ
			|	ТипыРабочихДней.Ссылка <> &Ссылка
			|	И ТипыРабочихДней.РабочийПоУмолчанию";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			об = Выборка.Ссылка.ПолучитьОбъект();
			об.РабочийПоУмолчанию = Ложь;
			об.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВыходнойПоУмолчанию Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТипыРабочихДней.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ТипыРабочихДней КАК ТипыРабочихДней
			|ГДЕ
			|	ТипыРабочихДней.Ссылка <> &Ссылка
			|	И ТипыРабочихДней.ВыходнойПоУмолчанию";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			об = Выборка.Ссылка.ПолучитьОбъект();
			об.ВыходнойПоУмолчанию = Ложь;
			об.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
